/*---------------------------------------------------
	Other.C (v1.00)
	
	其他函数
---------------------------------------------------*/	

#include "main.h"
#include "port.h"

#include "Other.h"
#include "delay.h"

// -------- Publice variable definitions -------------------------


// -------- Publice variable declarations ------------------------


/*----------------------------------------------------------------
	Moto_Vibration()
	使马达振动一段时间，通过控制PIN15的高低电平，来控制马达的电流
-----------------------------------------------------------------*/
void Moto_Vibration(void)
	{
	Moto_EN=0;				
	Delay(10);
	Moto_EN=1;
	}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/