/*----------------------------------------------------
	port.h (v1.00)

	'port header' (see chap 5) for DDC-F
----------------------------------------------------*/

#ifndef _PORT_H
#define _PORT_H

#include "main.h"

// 发射机模式控制,0为大功率，1为小功率
sbit ModeControl_1=P2^6;

// 接收机使能，1打开接收机，0关闭接收机，要加上拉电阻			
sbit receive_en=P1^3;		

// 发射机使能，1打开发射机，0关闭发射机
sbit tran_en=P2^7;			


// 振动器控制，0振动，1不振动
sbit Moto=P2^4;	

// 功放开关控制，1为打开功放，0为关闭功放
sbit PAshutdown=P1^4;

//语音控制，用来调用哪一段语音信号
sbit SC_RST=P2^0; //P2.0 是脉冲复位脚
sbit SC_DATA=P2^1; //P2.1 是脉冲数据脚

#endif
											
/*---------------------------------------------------
	end of file
----------------------------------------------------*/