/*---------------------------------------------------
	voice.c (v1.00)
	
	语音提示子程序
---------------------------------------------------*/

#include "main.h"
#include "port.h"

#include "voice.h"
#include "Delay.h"
   
/*--------------------------------------------------
	SC_Speech()
	
	调用语音芯片，播报语音提示，几次脉冲表示播放第
	几段语音提示
---------------------------------------------------*/

void SC_Speech(unsigned char cnt)
	{
	unsigned char i;
	SC_RST=0;
	delay_ms(40);
	SC_RST=1;
	delay_ms(40);
	for(i=0;i < cnt;i++)
		{
		SC_DATA=1; 	// 数据脉冲高
		delay_us(350); 	// 延时 100US
		SC_DATA=0; 	// 数据脉冲低
		delay_us(350); 	// 延时 100US
		}
	}

/*-------------------------------------------------
	noVoice()
	
	在上电的时候调用，屏蔽语音的误报
--------------------------------------------------*/

void noVoice()
	{
	P14=0;
	SC_DATA=0;
	SC_RST=0;
	delay_us(1000); //上电复位防止干扰发声
	SC_RST=1;
	delay_us(1000);
	P14=1;
	}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/