/*---------------------------------------------------
	voice.c (v1.00)
	
	语音提示子程序
---------------------------------------------------*/

#include "main.h"
#include "port.h"

#include "voice.h"
#include "Delay.h"
   
/*--------------------------------------------------
	SC_Speech()
	
	调用语音芯片，播报语音提示，几次脉冲表示播放第
	几段语音提示
---------------------------------------------------*/
void SC_Speech(tByte cnt)
	{                   
	tByte i;
	SC_RST = 0;
	delay_ms(40);
	SC_RST = 1;
	delay_ms(40);
	for(i=0;i < cnt;i++)
		{
		SC_DATA = 1; 	// 数据脉冲高
		delay_us(350); 	// 延时 100US
		SC_DATA = 0; 	// 数据脉冲低
		delay_us(350); 	// 延时 100US
		}
	}

/*-------------------------------------------------
	noVoice()
	
	在上电的时候调用，屏蔽语音的误报
--------------------------------------------------*/
void noVoice()
	{
	P14 = 0;
	SC_DATA = 0;
	SC_RST = 0;
	delay_us(1000);	//上电复位防止干扰发声
	SC_RST = 1;
	delay_us(1000);
	P14 = 1;
	}

/*-------------------------------------------------------------
	Alarm_stolen_speech()
	被盗之后的报警语音，附机接收到主机的被盗信号，发出语音提示
---------------------------------------------------------------*/
void Alarm_stolen_speech(void)
	{
	Voice_EN = 1;
	SC_Speech(5);
	Delay(100);
	SC_Speech(12);
	Delay(50);
	Voice_EN = 0;
	}
	
/*--------------------------------------------------------------
	Alarm_raised_speech()
	主机被抬起时，给附机发信号，附机语音提示主机被抬起。
---------------------------------------------------------------*/
void Alarm_raised_speech(void)
	{
	Voice_EN = 1;
	SC_Speech(3);
	Delay(140);
	Voice_EN = 0;
	}
	
/*--------------------------------------------------------------
	Alarm_fell_speech()
	主机摔倒在地上后，附机语音提示主机倒地上了。
----------------------------------------------------------------*/
void Alarm_fell_speech(void)
	{
	Voice_EN = 1;
	SC_Speech(2);
	Delay(120);
	Voice_EN = 0;
	}
	
/*---------------------------------------------------------------
	Battery_low_alarm_speech()
	电量低于一定值的时候，附机语音提示电量不足
----------------------------------------------------------------*/
void Battery_low_alarm_speech(void)
	{
		Voice_EN = 1;
		SC_Speech(10);
		Delay(120);
		Voice_EN = 0;
	}

/*---------------------------------------------------------------
	Battery_high_alarm_speech()
	附机电池电量高于一定值，表示电池充满电，语音提示充满
----------------------------------------------------------------*/
void Battery_high_alarm_speech(void)
	{
	Voice_EN = 1;
	SC_Speech(7);
	Delay(120);
	Voice_EN = 0;
	}
	
/*---------------------------------------------------------------
	Host_battery_high_alarm_speech()
	当主机电充满后，发送信号给附机，附机收到后，语音提示主机充满电
	了。
---------------------------------------------------------------*/
void Host_battery_high_alarm_speech(void)
	{
		Voice_EN = 1;
		SC_Speech(7);  
		Delay(80);
		Voice_EN = 0;
	}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/