/*---------------------------------------------------
	Delay.c (v1.00)
	
	Delay functions
---------------------------------------------------*/	

#include "main.h"
#include "port.h"

#include "Delay.h"

/*---------------------------------------------------
	Delay()
	延迟程序
--------------------------------------------------*/

void Delay(unsigned int n)
{
	unsigned int x;
	while(n--)
	{
		x=5000;
		while(x--);
	}
}

/*---------------------------------------------------
	Delay3()
	延迟程序
--------------------------------------------------*/

void Delay3(unsigned int t)
{
	tWord i;
	tByte j;
	for(i=0;i<t;i++)		
	for(j=0;j<21;j++);
}

/*---------------------------------------------------
	Delay4()
	延迟程序
--------------------------------------------------*/

void Delay4(tWord t)
{
	tWord i;
	tByte j;
	for(i=0;i<t;i++)		
	for(j=0;j<34;j++);
}
	
/*--------------------------------------------------
	delay_ms()
	
	延迟约为1ms的子程序
----------------------------------------------------*/

void delay_ms(unsigned int count)
{
	unsigned int i;
	unsigned int j;
	for(i=0;i<count;i++)
	{
		for(j=0;j<500;j++);
	}
}

/*--------------------------------------------------
	delay_us()
	
	延迟约为1us的子程序
----------------------------------------------------*/

void delay_us(unsigned int count1)
{
	unsigned int i;
	unsigned char j;
	for(i=0;i<count1;i++)
	{
		for(j=0;j<20;j++);
	}
}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/
