/*---------------------------------------------------
	Other.c (v1.00)
	
	其他程序
---------------------------------------------------*/

#include "main.h"
#include "port.h"

#include "Other.h"
#include "Delay.h"

/*-------------------------------------------------------
	magnet_CW()
	电磁铁正转，顺时针
--------------------------------------------------------*/
void magnet_CW(void)
	{
	MagentControl_1=0;//关闭磁铁
	MagentControl_2=1;
	Delay(13);
	MagentControl_1=0;//磁铁常态为这种模式
	MagentControl_2=0;
	}

/*-------------------------------------------------------
	magnet_ACW()
	电磁铁反转，逆时针
--------------------------------------------------------*/
void magnet_ACW(void)
	{
	MagentControl_1=1;//开启磁铁
	MagentControl_2=0;
	Delay(13);
	MagentControl_1=0;//磁铁常态为这种模式
	MagentControl_2=0;
	}
/*---------------------------------------------------
	end of file
----------------------------------------------------*/