/*---------------------------------------------------
	voice.c (v1.00)
	
	语音提示子程序
---------------------------------------------------*/

#include "main.h"
#include "port.h"

#include "voice.h"
#include "Delay.h"
   
/*--------------------------------------------------
	SC_Speech()
	
	调用语音芯片，播报语音提示，几次脉冲表示播放第
	几段语音提示
---------------------------------------------------*/

void SC_Speech(unsigned char cnt)
{
	unsigned char i;
//	SC_RST=1;
//	delay_ms(15); //DAC, 大于 32 段为 15MS
	SC_RST=0;
	delay_ms(40);
	SC_RST=1;
	delay_ms(40);
	for(i=0;i < cnt;i++)
	{
		SC_DATA=1; // 数据脉冲高
//		delay_us(350); // 延时 100US
		delay_us(30);
		SC_DATA=0; // 数据脉冲低
//		delay_us(350); // 延时 100US
		delay_us(30);
	}
}

/*--------------------------------------------------
	SC_Speech2()
	
	调用语音芯片，播报语音提示，几次脉冲表示播放第
	几段语音提示
---------------------------------------------------*/

void SC_Speech2(unsigned char cnt)
{
	unsigned char i;
//	SC_RST=1;
//	delay_ms(15); //DAC, 大于 32 段为 15MS
	SC_RST=0;
	delay_ms(40);
	SC_RST=1;
	delay_ms(40);
	for(i=0;i < cnt;i++)
	{
		SC_DATA=1; // 数据脉冲高
//		delay_us(350); // 延时 100US
		delay_us(30);
		SC_DATA=0; // 数据脉冲低
//		delay_us(350); // 延时 100US
		delay_us(30);
	}
}

/*-------------------------------------------------
	noVoice()
	
	在上电的时候调用，屏蔽语音的误报
--------------------------------------------------*/

void noVoice()
{
	P14=0;
	SC_DATA=0;
	SC_RST=0;
	delay_us(100); // 上电复位防止干扰发声
	SC_RST=1;
	delay_us(100);
	P14=1;
}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/